


import math

print("--- Программа для вычисления площади кольца ---")

try:
    # ввод радиусов
    R = float(input("Введите внешний радиус кольца (R): "))
    r = float(input("Введите внутренний радиус кольца (r): "))

    # Проверка данных
    if R <= 0 or r <= 0:
        print("Ошибка: Радиусы должны быть больше нуля!")
    elif R <= r:
        print("Ошибка: Внешний радиус (R) должен быть больше внутреннего (r)!")
    else:
        # вычисляем площадь
        S = math.pi * (R**2 - r**2)
        # Выводим результат и округляем до 2 знаков после запятой
        print(f"Площадь кольца равна: {S:.2f}")

except ValueError:
    print("Ошибка: Вводите только числа.")

input()
