


print("--- Проверка попадания точки в областьv---")

try:
    # координаты точки
    x = float(input("Введите координату x: "))
    y = float(input("Введите координату y: "))

    # Условие для верхнего левого участка
    in_up = (y >= x**2) and (y >= 2 - x)
    
    # Условие для нижнего правого участка
    in_low = (y <= x**2) and (y <= 2 - x)

    # Проверяем, попала ли точка хотя бы в одну из зон
    if in_up or in_low:
        print("Ответ: Точка ПРИНАДЛЕЖИТ заштрихованной области.")
    else:
        print("Ответ: Точка НЕ ПРИНАДЛЕЖИТ заштрихованной области.")

except ValueError:
    print("Ошибка: Пожалуйста, вводите только числовые значения.")


input()
